In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

### 1-3 pandas 기초 익히기 \'(^ㅁ^)/

In [42]:
s=pd.Series([1,3,5,np.nan,6,8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [88]:
# 기본날짜를 지정하고 periods옵션으로 6일간이라고 지정
dates=pd.date_range('20130101',periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [46]:
df= pd.DataFrame(np.random.randn(6,4), index=dates, columns=['A','B','C','D'])
df.head(3)

                   A         B         C         D
2013-01-01  2.034326  0.391132  1.682740 -0.686996
2013-01-02  0.674211 -1.193833  1.133864 -2.939134
2013-01-03  0.914461  0.102090 -0.729514 -0.258899

In [47]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [48]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [49]:
df.values #데이터프레임 안의 내용 array반환

array([[ 2.03432576,  0.39113181,  1.68274039, -0.68699576],
       [ 0.67421119, -1.19383258,  1.13386382, -2.93913351],
       [ 0.9144613 ,  0.10209049, -0.72951441, -0.25889877],
       [ 1.73731392, -0.65780738,  0.42525253,  0.75603298],
       [-0.69227207,  0.55742342, -1.71514218,  0.04096363],
       [-1.44184809, -0.39935726, -0.1674612 ,  1.78680832]])

In [51]:
df.info() # 데이터프레임 개요

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 6 entries, 2013-01-01 to 2013-01-06
Freq: D
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       6 non-null      float64
 1   B       6 non-null      float64
 2   C       6 non-null      float64
 3   D       6 non-null      float64
dtypes: float64(4)
memory usage: 400.0 bytes

In [53]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.537699 -0.200059  0.104956 -0.216871
std    1.361689  0.671032  1.243700  1.591304
min   -1.441848 -1.193833 -1.715142 -2.939134
25%   -0.350651 -0.593195 -0.589001 -0.579972
50%    0.794336 -0.148633  0.128896 -0.108968
75%    1.531601  0.318871  0.956711  0.577266
max    2.034326  0.557423  1.682740  1.786808

In [89]:
df.sort_values(by='B',ascending=False)
# by로 지정된 컬럼을 기준으로 정렬, ascending옵션을 사용하면 내림차순이나 오름차순으로 정렬

                   A         B         C         D
2013-01-05 -0.692272  0.557423 -1.715142  0.040964
2013-01-01  2.034326  0.391132  1.682740 -0.686996
2013-01-03  0.914461  0.102090 -0.729514 -0.258899
2013-01-06 -1.441848 -0.399357 -0.167461  1.786808
2013-01-04  1.737314 -0.657807  0.425253  0.756033
2013-01-02  0.674211 -1.193833  1.133864 -2.939134

In [57]:
df

                   A         B         C         D
2013-01-01  2.034326  0.391132  1.682740 -0.686996
2013-01-02  0.674211 -1.193833  1.133864 -2.939134
2013-01-03  0.914461  0.102090 -0.729514 -0.258899
2013-01-04  1.737314 -0.657807  0.425253  0.756033
2013-01-05 -0.692272  0.557423 -1.715142  0.040964
2013-01-06 -1.441848 -0.399357 -0.167461  1.786808

In [58]:
df['A']

2013-01-01    2.034326
2013-01-02    0.674211
2013-01-03    0.914461
2013-01-04    1.737314
2013-01-05   -0.692272
2013-01-06   -1.441848
Freq: D, Name: A, dtype: float64

In [59]:
df[0:3]

                   A         B         C         D
2013-01-01  2.034326  0.391132  1.682740 -0.686996
2013-01-02  0.674211 -1.193833  1.133864 -2.939134
2013-01-03  0.914461  0.102090 -0.729514 -0.258899

In [60]:
df['20130102':'20130104'] # 해당하는 일자의 행 출력 'YYYYMMDD'

                   A         B         C         D
2013-01-02  0.674211 -1.193833  1.133864 -2.939134
2013-01-03  0.914461  0.102090 -0.729514 -0.258899
2013-01-04  1.737314 -0.657807  0.425253  0.756033

In [61]:
df.loc[dates[0]]

A    2.034326
B    0.391132
C    1.682740
D   -0.686996
Name: 2013-01-01 00:00:00, dtype: float64

In [62]:
df.loc[:,['A','B']] #'A','B'열의 모든 행

                   A         B
2013-01-01  2.034326  0.391132
2013-01-02  0.674211 -1.193833
2013-01-03  0.914461  0.102090
2013-01-04  1.737314 -0.657807
2013-01-05 -0.692272  0.557423
2013-01-06 -1.441848 -0.399357

In [63]:
df.loc['20130102':'20130104',['A','B']]

                   A         B
2013-01-02  0.674211 -1.193833
2013-01-03  0.914461  0.102090
2013-01-04  1.737314 -0.657807

In [64]:
df.loc['20130102',['A','B']]

A    0.674211
B   -1.193833
Name: 2013-01-02 00:00:00, dtype: float64

In [65]:
df.loc[dates[0],'A']

2.034325758541224

In [66]:
df.iloc[3]

A    1.737314
B   -0.657807
C    0.425253
D    0.756033
Name: 2013-01-04 00:00:00, dtype: float64

In [67]:
df.iloc[3:5, 0:2]

                   A         B
2013-01-04  1.737314 -0.657807
2013-01-05 -0.692272  0.557423

In [68]:
df.iloc[[1,2,4],[0,2]]

                   A         C
2013-01-02  0.674211  1.133864
2013-01-03  0.914461 -0.729514
2013-01-05 -0.692272 -1.715142

In [69]:
df.iloc[1:3, :]

                   A         B         C         D
2013-01-02  0.674211 -1.193833  1.133864 -2.939134
2013-01-03  0.914461  0.102090 -0.729514 -0.258899

In [70]:
df.iloc[:,1:3]

                   B         C
2013-01-01  0.391132  1.682740
2013-01-02 -1.193833  1.133864
2013-01-03  0.102090 -0.729514
2013-01-04 -0.657807  0.425253
2013-01-05  0.557423 -1.715142
2013-01-06 -0.399357 -0.167461

In [72]:
df

                   A         B         C         D
2013-01-01  2.034326  0.391132  1.682740 -0.686996
2013-01-02  0.674211 -1.193833  1.133864 -2.939134
2013-01-03  0.914461  0.102090 -0.729514 -0.258899
2013-01-04  1.737314 -0.657807  0.425253  0.756033
2013-01-05 -0.692272  0.557423 -1.715142  0.040964
2013-01-06 -1.441848 -0.399357 -0.167461  1.786808

In [73]:
df[df['A']>0] # 특정조건을 만족하는 데이터

                   A         B         C         D
2013-01-01  2.034326  0.391132  1.682740 -0.686996
2013-01-02  0.674211 -1.193833  1.133864 -2.939134
2013-01-03  0.914461  0.102090 -0.729514 -0.258899
2013-01-04  1.737314 -0.657807  0.425253  0.756033

In [74]:
df[df>0]

                   A         B         C         D
2013-01-01  2.034326  0.391132  1.682740       NaN
2013-01-02  0.674211       NaN  1.133864       NaN
2013-01-03  0.914461  0.102090       NaN       NaN
2013-01-04  1.737314       NaN  0.425253  0.756033
2013-01-05       NaN  0.557423       NaN  0.040964
2013-01-06       NaN       NaN       NaN  1.786808

In [78]:
df2 = df.copy() #데이터 위치만 복사 (원본데이터는 하나)
df2['E']=['one','one','two','three','four','three']
df2

                   A         B         C         D      E
2013-01-01  2.034326  0.391132  1.682740 -0.686996    one
2013-01-02  0.674211 -1.193833  1.133864 -2.939134    one
2013-01-03  0.914461  0.102090 -0.729514 -0.258899    two
2013-01-04  1.737314 -0.657807  0.425253  0.756033  three
2013-01-05 -0.692272  0.557423 -1.715142  0.040964   four
2013-01-06 -1.441848 -0.399357 -0.167461  1.786808  three

In [86]:
df2['E'].isin(['two','four']) # 컬럼 내에서 조건을 걸고싶을 때 .isin()

2013-01-01    False
2013-01-02    False
2013-01-03     True
2013-01-04    False
2013-01-05     True
2013-01-06    False
Freq: D, Name: E, dtype: bool

In [87]:
df2[df2['E'].isin(['two','four'])]

                   A         B         C         D     E
2013-01-03  0.914461  0.102090 -0.729514 -0.258899   two
2013-01-05 -0.692272  0.557423 -1.715142  0.040964  four

In [90]:
df.apply(np.cumsum) # 누적합

                   A         B         C         D
2013-01-01  2.034326  0.391132  1.682740 -0.686996
2013-01-02  2.708537 -0.802701  2.816604 -3.626129
2013-01-03  3.622998 -0.700610  2.087090 -3.885028
2013-01-04  5.360312 -1.358418  2.512342 -3.128995
2013-01-05  4.668040 -0.800994  0.797200 -3.088031
2013-01-06  3.226192 -1.200352  0.629739 -1.301223

In [84]:
df.apply(lambda x:x.max()-x.min())

A    3.476174
B    1.751256
C    3.397883
D    4.725942
dtype: float64

In [6]:
CCTV_Seoul.head()

   기관명    소계  2013년도 이전  2014년  2015년  2016년
0  강남구  2780       1292    430    584    932
1  강동구   773        379     99    155    377
2  강북구   748        369    120    138    204
3  강서구   884        388    258    184     81
4  관악구  1496        846    260    390    613